# Auto-generated by Digital Logic Equivalence Check Agent
read_verilog -sv "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/41674526-178c-4697-8807-decc13101353/ba0e4323-1a09-4cd3-a062-2e5e5913a435/digital/arch2synthesis/digital/synth/rtl/uart_packet_engine.v"
hierarchy -check -top uart_packet_engine
proc; opt; memory; opt
async2sync
flatten
splitnets -ports
opt_clean
rename -top gold
design -stash gold

read_verilog -sv -D FUNCTIONAL "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/41674526-178c-4697-8807-decc13101353/ba0e4323-1a09-4cd3-a062-2e5e5913a435/digital/arch2synthesis/digital/lec/input/stdcell_functional_wrappers.v"

read_verilog -sv "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/41674526-178c-4697-8807-decc13101353/ba0e4323-1a09-4cd3-a062-2e5e5913a435/digital/arch2synthesis/digital/synth/netlist/uart_packet_engine_synth.v"
hierarchy -check -top uart_packet_engine
proc; opt; memory; opt
async2sync
flatten
splitnets -ports
opt_clean
rename -top gate
design -stash gate

design -copy-from gold -as gold gold
design -copy-from gate -as gate gate
equiv_make gold gate equiv
hierarchy -top equiv
equiv_simple -seq 20
equiv_induct -undef -seq 256
equiv_simple -seq 50
equiv_status -assert
