# Auto-generated by Digital Post-DFT Logic Equivalence Check Agent
read_verilog -sv -D FUNCTIONAL "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/43c71124-316e-411a-ba15-1e794fa059b8/de6a80c1-7843-495a-a19e-f72bbbbc2fce/digital/digital/post_dft_lec/input/stdcell_functional_wrappers.v"

read_verilog -sv "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/43c71124-316e-411a-ba15-1e794fa059b8/de6a80c1-7843-495a-a19e-f72bbbbc2fce/digital/digital/synth/netlist/temp_monitor_soc_phys_synth.v"
hierarchy -check -top temp_monitor_soc_phys
proc; opt; memory; opt
async2sync
flatten
splitnets -ports
opt_clean
rename -top gold
design -stash gold

design -reset
read_verilog -sv -D FUNCTIONAL "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/43c71124-316e-411a-ba15-1e794fa059b8/de6a80c1-7843-495a-a19e-f72bbbbc2fce/digital/digital/post_dft_lec/input/stdcell_functional_wrappers.v"

read_verilog -sv "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/43c71124-316e-411a-ba15-1e794fa059b8/de6a80c1-7843-495a-a19e-f72bbbbc2fce/digital/digital/dft/scan_stitched_netlist.v"
hierarchy -check -top temp_monitor_soc_phys
proc; opt; memory; opt
async2sync
flatten
delete -port w:scan_en w:scan_in w:scan_out
splitnets -ports
opt_clean
rename -top gate
design -stash gate

design -copy-from gold -as gold gold
design -copy-from gate -as gate gate
equiv_make gold gate equiv
hierarchy -top equiv
equiv_simple -seq 20
equiv_induct -undef -seq 256
equiv_simple -seq 50
equiv_status -assert
