# Auto-generated by Digital Tapeout Logic Equivalence Check Agent
read_verilog -sv "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/26f356cb-6d29-43be-a1da-649876540ea6/6d479abf-c006-4bf3-b6cb-21bcf6d57fc4/digital/system/imported_rtl/temp_sensor_adc_model.v"
read_verilog -sv "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/26f356cb-6d29-43be-a1da-649876540ea6/6d479abf-c006-4bf3-b6cb-21bcf6d57fc4/digital/system/imported_rtl/temp_monitor_digital.v"
read_verilog -sv "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/26f356cb-6d29-43be-a1da-649876540ea6/6d479abf-c006-4bf3-b6cb-21bcf6d57fc4/digital/system/imported_rtl/temp_monitor_soc_phys.sv"
read_verilog -sv "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/26f356cb-6d29-43be-a1da-649876540ea6/6d479abf-c006-4bf3-b6cb-21bcf6d57fc4/digital/system/imported_rtl/temp_monitor_soc_sim.sv"
hierarchy -check -top temp_monitor_soc_phys
proc; opt; memory; opt
async2sync
flatten
splitnets -ports
opt_clean
rename -top gold
design -stash gold

read_verilog -sv -D FUNCTIONAL "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/26f356cb-6d29-43be-a1da-649876540ea6/6d479abf-c006-4bf3-b6cb-21bcf6d57fc4/digital/digital/tapeout_lec/input/stdcell_functional_wrappers.v"
read_verilog -sv "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/26f356cb-6d29-43be-a1da-649876540ea6/6d479abf-c006-4bf3-b6cb-21bcf6d57fc4/digital/digital/tapeout_lec/input/temp_monitor_soc_phys.pnl.v"
hierarchy -check -top temp_monitor_soc_phys
proc; opt; memory; opt
async2sync
flatten
splitnets -ports
opt_clean
delete -port w:VGND w:VPWR
rename -top gate
design -stash gate

design -copy-from gold -as gold gold
design -copy-from gate -as gate gate
equiv_make gold gate equiv
hierarchy -top equiv
equiv_simple -seq 20
equiv_induct -undef -seq 256
equiv_simple -seq 50
equiv_status -assert
