# Auto-generated by Digital Logic Equivalence Check Agent
read_verilog -sv "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/66824e7a-3cde-48fb-b749-103e943218da/a7fd894e-4881-4694-96f6-fb332687c994/digital/system/imported_rtl/temp_monitor_digital.v"
read_verilog -sv "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/66824e7a-3cde-48fb-b749-103e943218da/a7fd894e-4881-4694-96f6-fb332687c994/digital/system/imported_rtl/temp_monitor_soc_phys.sv"
read_verilog -sv "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/66824e7a-3cde-48fb-b749-103e943218da/a7fd894e-4881-4694-96f6-fb332687c994/digital/system/imported_rtl/temp_monitor_soc_sim.sv"
read_verilog -sv "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/66824e7a-3cde-48fb-b749-103e943218da/a7fd894e-4881-4694-96f6-fb332687c994/digital/digital/lec/input/temp_sensor_adc_model_blackbox.v"
hierarchy -check -top temp_monitor_soc_phys
proc; opt; memory; opt
async2sync
flatten
splitnets -ports
opt_clean
rename -top gold
design -stash gold

read_verilog -sv -D FUNCTIONAL "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/66824e7a-3cde-48fb-b749-103e943218da/a7fd894e-4881-4694-96f6-fb332687c994/digital/digital/lec/input/stdcell_functional_wrappers.v"
read_verilog -sv "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/66824e7a-3cde-48fb-b749-103e943218da/a7fd894e-4881-4694-96f6-fb332687c994/digital/digital/lec/input/temp_sensor_adc_model_blackbox.v"
read_verilog -sv "/root/chiploop-backend/artifacts/3c6dfa47-ba1d-4be5-857c-c60b38fc0ff6/66824e7a-3cde-48fb-b749-103e943218da/a7fd894e-4881-4694-96f6-fb332687c994/digital/digital/synth/netlist/temp_monitor_soc_phys_synth.v"
hierarchy -check -top temp_monitor_soc_phys
proc; opt; memory; opt
async2sync
flatten
splitnets -ports
opt_clean
rename -top gate
design -stash gate

design -copy-from gold -as gold gold
design -copy-from gate -as gate gate
equiv_make gold gate equiv
hierarchy -top equiv
equiv_simple -seq 20
equiv_induct -undef -seq 256
equiv_simple -seq 50
equiv_status -assert
